#### Terraform Plan (prod)
```
Acquiring state lock. This may take a few moments...
module.lambda.aws_iam_role.lambda: Refreshing state... [id=health-logger-prod-lambda-role]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::143944071087:oidc-provider/token.actions.githubusercontent.com]
data.aws_region.current: Reading...
module.s3tables.aws_s3tables_table_bucket.main: Refreshing state... [name=health-logger-prod-health-tables]
module.amplify.aws_iam_role.amplify_backend: Refreshing state... [id=health-logger-prod-amplify-backend]
module.lambda.aws_iam_role.scheduler: Refreshing state... [id=health-logger-prod-scheduler-role]
module.s3.aws_s3_bucket.export: Refreshing state... [id=health-logger-prod-health-export]
module.cognito.data.aws_region.current: Reading...
module.apigw.aws_apigatewayv2_api.main: Refreshing state... [id=85p9dy4ve3]
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.lambda.aws_s3_bucket.artifacts: Refreshing state... [id=health-logger-prod-lambda-artifacts]
module.cognito.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.firehose.data.aws_caller_identity.current: Reading...
module.glue.aws_glue_catalog_database.main: Refreshing state... [id=143944071087:health_logger_prod_health_logs]
module.firehose.data.aws_caller_identity.current: Read complete after 0s [id=143944071087]
data.aws_caller_identity.current: Reading...
module.firehose.aws_iam_role.firehose: Refreshing state... [id=health-logger-prod-firehose-role]
module.glue.aws_iam_role.glue: Refreshing state... [id=health-logger-prod-glue-role]
module.lambda.aws_dynamodb_table.item_configs: Refreshing state... [id=health-logger-prod-item-configs]
data.aws_caller_identity.current: Read complete after 0s [id=143944071087]
module.lambda.aws_dynamodb_table.push_subscriptions: Refreshing state... [id=health-logger-prod-push-subscriptions]
module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=ap-northeast-1_tgfTb5wsC]
module.firehose.data.aws_region.current: Reading...
module.firehose.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
aws_iam_role.github_actions: Refreshing state... [id=health-logger-prod-github-actions]
module.lambda.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=health-logger-prod-lambda-role/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.amplify.aws_iam_role_policy.amplify_build: Refreshing state... [id=health-logger-prod-amplify-backend:terraform-20260307081640085000000001]
module.glue.aws_iam_role_policy_attachment.glue_service: Refreshing state... [id=health-logger-prod-glue-role/arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole]
module.apigw.aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
module.s3tables.aws_s3tables_namespace.health: Refreshing state...
module.glue.aws_iam_role_policy.glue_s3tables: Refreshing state... [id=health-logger-prod-glue-role:terraform-20260307050256388900000002]
module.s3tables.aws_s3tables_table.health_records: Refreshing state... [name=health_records]
module.cognito.aws_cognito_user_pool_domain.main: Refreshing state... [id=health-logger-prod]
module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=4cn5j24rcr7t8hj1vlv99esr74]
module.apigw.aws_apigatewayv2_authorizer.cognito: Refreshing state... [id=kesjzp]
module.amplify.aws_amplify_app.main: Refreshing state... [id=d24eyg8x5429ma]
module.amplify.aws_amplify_branch.main: Refreshing state... [id=d24eyg8x5429ma/main]
module.s3.aws_s3_bucket_versioning.export: Refreshing state... [id=health-logger-prod-health-export]
module.s3.aws_s3_bucket_server_side_encryption_configuration.export: Refreshing state... [id=health-logger-prod-health-export]
module.s3.aws_s3_bucket_public_access_block.export: Refreshing state... [id=health-logger-prod-health-export]
module.firehose.aws_iam_role_policy.firehose: Refreshing state... [id=health-logger-prod-firehose-role:terraform-20260307050254985700000001]
module.s3.aws_s3_bucket_lifecycle_configuration.export: Refreshing state... [id=health-logger-prod-health-export]
module.glue.aws_glue_catalog_table.health_records: Refreshing state... [id=143944071087:health_logger_prod_health_logs:health_records]
module.firehose.aws_kinesis_firehose_delivery_stream.health_records: Refreshing state... [id=arn:aws:firehose:ap-northeast-1:143944071087:deliverystream/health-logger-prod-health-records]
aws_iam_role_policy.github_actions: Refreshing state... [id=health-logger-prod-github-actions:terraform-20260307053213120500000001]
module.lambda.aws_lambda_function.get_latest: Refreshing state... [id=health-logger-prod-get-latest]
module.lambda.aws_s3_bucket_public_access_block.artifacts: Refreshing state... [id=health-logger-prod-lambda-artifacts]
module.lambda.aws_iam_role_policy.lambda: Refreshing state... [id=health-logger-prod-lambda-role:terraform-20260307054549449100000001]
module.lambda.aws_lambda_function.create_record: Refreshing state... [id=health-logger-prod-create-record]
module.apigw.aws_lambda_permission.get_latest: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apigw.aws_apigatewayv2_integration.get_latest: Refreshing state... [id=7x1nnjs]
module.apigw.aws_apigatewayv2_route.health: Refreshing state... [id=dtn084t]
module.apigw.aws_apigatewayv2_route.get_latest: Refreshing state... [id=eurpfka]
module.apigw.aws_lambda_permission.create_record: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apigw.aws_apigatewayv2_integration.create_record: Refreshing state... [id=2nmh2hi]
module.apigw.aws_apigatewayv2_route.create_record: Refreshing state... [id=92kvkz9]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.amplify.aws_amplify_app.main will be updated in-place
  ~ resource "aws_amplify_app" "main" {
      ~ environment_variables         = {
          + "VITE_VAPID_PUBLIC_KEY"     = "BGbMa-2TTTKLB084xCOqAgqk6S85mdmT8j_7Pyxg7xpK-Lr0-iH_9O9IDANa7Kocfmald-uGv_Pu3A4kqPQ6YYI"
            # (4 unchanged elements hidden)
        }
        id                            = "d24eyg8x5429ma"
        name                          = "health-logger-prod"
        tags                          = {}
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.apigw.aws_apigatewayv2_integration.get_item_config will be created
  + resource "aws_apigatewayv2_integration" "get_item_config" {
      + api_id                                    = "85p9dy4ve3"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "ap-northeast-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.apigw.aws_apigatewayv2_integration.push_subscribe will be created
  + resource "aws_apigatewayv2_integration" "push_subscribe" {
      + api_id                                    = "85p9dy4ve3"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "ap-northeast-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.apigw.aws_apigatewayv2_integration.save_item_config will be created
  + resource "aws_apigatewayv2_integration" "save_item_config" {
      + api_id                                    = "85p9dy4ve3"
      + connection_type                           = "INTERNET"
      + id                                        = (known after apply)
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "2.0"
      + region                                    = "ap-northeast-1"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.apigw.aws_apigatewayv2_route.get_item_config will be created
  + resource "aws_apigatewayv2_route" "get_item_config" {
      + api_id             = "85p9dy4ve3"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "kesjzp"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + route_key          = "GET /items/config"
      + target             = (known after apply)
    }

  # module.apigw.aws_apigatewayv2_route.push_subscribe_delete will be created
  + resource "aws_apigatewayv2_route" "push_subscribe_delete" {
      + api_id             = "85p9dy4ve3"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "kesjzp"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + route_key          = "DELETE /push/subscribe"
      + target             = (known after apply)
    }

  # module.apigw.aws_apigatewayv2_route.push_subscribe_post will be created
  + resource "aws_apigatewayv2_route" "push_subscribe_post" {
      + api_id             = "85p9dy4ve3"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "kesjzp"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + route_key          = "POST /push/subscribe"
      + target             = (known after apply)
    }

  # module.apigw.aws_apigatewayv2_route.save_item_config will be created
  + resource "aws_apigatewayv2_route" "save_item_config" {
      + api_id             = "85p9dy4ve3"
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = "kesjzp"
      + id                 = (known after apply)
      + region             = "ap-northeast-1"
      + route_key          = "POST /items/config"
      + target             = (known after apply)
    }

  # module.apigw.aws_lambda_permission.get_item_config will be created
  + resource "aws_lambda_permission" "get_item_config" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "health-logger-prod-get-item-config"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:143944071087:85p9dy4ve3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.apigw.aws_lambda_permission.push_subscribe will be created
  + resource "aws_lambda_permission" "push_subscribe" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "health-logger-prod-push-subscribe"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:143944071087:85p9dy4ve3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.apigw.aws_lambda_permission.save_item_config will be created
  + resource "aws_lambda_permission" "save_item_config" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "health-logger-prod-save-item-config"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-northeast-1"
      + source_arn          = "arn:aws:execute-api:ap-northeast-1:143944071087:85p9dy4ve3/*/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.lambda.aws_dynamodb_table.item_configs is tainted, so must be replaced
-/+ resource "aws_dynamodb_table" "item_configs" {
      ~ arn                         = "arn:aws:dynamodb:ap-northeast-1:143944071087:table/health-logger-prod-item-configs" -> (known after apply)
      - deletion_protection_enabled = false -> null
      ~ id                          = "health-logger-prod-item-configs" -> (known after apply)
        name                        = "health-logger-prod-item-configs"
      ~ read_capacity               = 0 -> (known after apply)
      + stream_arn                  = (known after apply)
      - stream_enabled              = false -> null
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      ~ write_capacity              = 0 -> (known after apply)
        # (4 unchanged attributes hidden)

      - point_in_time_recovery {
          - enabled                 = false -> null
          - recovery_period_in_days = 0 -> null
        }

      - ttl {
          - enabled = false -> null
        }

        # (1 unchanged block hidden)
    }

  # module.lambda.aws_dynamodb_table.push_subscriptions is tainted, so must be replaced
-/+ resource "aws_dynamodb_table" "push_subscriptions" {
      ~ arn                         = "arn:aws:dynamodb:ap-northeast-1:143944071087:table/health-logger-prod-push-subscriptions" -> (known after apply)
      - deletion_protection_enabled = false -> null
      ~ id                          = "health-logger-prod-push-subscriptions" -> (known after apply)
        name                        = "health-logger-prod-push-subscriptions"
      ~ read_capacity               = 0 -> (known after apply)
      + stream_arn                  = (known after apply)
      - stream_enabled              = false -> null
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      ~ write_capacity              = 0 -> (known after apply)
        # (4 unchanged attributes hidden)

      - point_in_time_recovery {
          - enabled                 = false -> null
          - recovery_period_in_days = 0 -> null
        }

      - ttl {
          - enabled = false -> null
        }

        # (1 unchanged block hidden)
    }

  # module.lambda.aws_iam_role_policy.lambda will be updated in-place
  ~ resource "aws_iam_role_policy" "lambda" {
        id          = "health-logger-prod-lambda-role:terraform-20260307054549449100000001"
        name        = "terraform-20260307054549449100000001"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "firehose:PutRecord",
                          - "firehose:PutRecordBatch",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:firehose:ap-northeast-1:143944071087:deliverystream/health-logger-prod-health-records",
                        ]
                    },
                  - {
                      - Action   = [
                          - "athena:StartQueryExecution",
                          - "athena:GetQueryExecution",
                          - "athena:GetQueryResults",
                          - "athena:StopQueryExecution",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:GetBucketLocation",
                          - "s3:ListBucket",
                          - "s3:ListBucketMultipartUploads",
                          - "s3:AbortMultipartUpload",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::health-logger-prod-health-export",
                          - "arn:aws:s3:::health-logger-prod-health-export/*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "glue:GetDatabase",
                          - "glue:GetTable",
                          - "glue:GetPartitions",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                          - "xray:PutTelemetryRecords",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.lambda.aws_iam_role_policy.scheduler will be created
  + resource "aws_iam_role_policy" "scheduler" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "health-logger-prod-scheduler-role"
    }

  # module.lambda.aws_lambda_function.get_item_config will be created
  + resource "aws_lambda_function" "get_item_config" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "health-logger-prod-get-item-config"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::143944071087:role/health-logger-prod-lambda-role"
      + runtime                        = "python3.13"
      + s3_bucket                      = "health-logger-prod-lambda-artifacts"
      + s3_key                         = "placeholder"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "health-logger"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ITEM_CONFIGS_TABLE" = "health-logger-prod-item-configs"
            }
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda.aws_lambda_function.push_notify will be created
  + resource "aws_lambda_function" "push_notify" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "health-logger-prod-push-notify"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::143944071087:role/health-logger-prod-lambda-role"
      + runtime                        = "python3.13"
      + s3_bucket                      = "health-logger-prod-lambda-artifacts"
      + s3_key                         = "placeholder"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "health-logger"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PUSH_SUBSCRIPTIONS_TABLE" = "health-logger-prod-push-subscriptions"
              + "VAPID_PRIVATE_KEY"        = (sensitive value)
            }
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda.aws_lambda_function.push_subscribe will be created
  + resource "aws_lambda_function" "push_subscribe" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "health-logger-prod-push-subscribe"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::143944071087:role/health-logger-prod-lambda-role"
      + runtime                        = "python3.13"
      + s3_bucket                      = "health-logger-prod-lambda-artifacts"
      + s3_key                         = "placeholder"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "health-logger"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "PUSH_SUBSCRIPTIONS_TABLE" = "health-logger-prod-push-subscriptions"
            }
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda.aws_lambda_function.save_item_config will be created
  + resource "aws_lambda_function" "save_item_config" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "health-logger-prod-save-item-config"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-northeast-1"
      + reserved_concurrent_executions = -1
      + response_streaming_invoke_arn  = (known after apply)
      + role                           = "arn:aws:iam::143944071087:role/health-logger-prod-lambda-role"
      + runtime                        = "python3.13"
      + s3_bucket                      = "health-logger-prod-lambda-artifacts"
      + s3_key                         = "placeholder"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "health-logger"
        }
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ITEM_CONFIGS_TABLE" = "health-logger-prod-item-configs"
            }
        }

      + tracing_config {
          + mode = "Active"
        }
    }

  # module.lambda.aws_scheduler_schedule.push_notify_daily will be created
  + resource "aws_scheduler_schedule" "push_notify_daily" {
      + action_after_completion      = (known after apply)
      + arn                          = (known after apply)
      + group_name                   = "default"
      + id                           = (known after apply)
      + name                         = "health-logger-prod-push-notify-daily"
      + name_prefix                  = (known after apply)
      + region                       = "ap-northeast-1"
      + schedule_expression          = "cron(0 12 * * ? *)"
      + schedule_expression_timezone = "UTC"
      + state                        = "ENABLED"

      + flexible_time_window {
          + maximum_window_in_minutes = 10
          + mode                      = "FLEXIBLE"
        }

      + target {
          + arn      = (known after apply)
          + role_arn = "arn:aws:iam::143944071087:role/health-logger-prod-scheduler-role"
        }
    }

Plan: 18 to add, 2 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```